In [1]:
import pandas as pd
import pyarrow as pa
import pyarrow.parquet as pq
import numpy as np
import os

In [7]:
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [2]:
path = '../data/M5_full.parquet'

df = pd.read_parquet(path)

In [44]:
df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,value,date
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29

In [3]:
df['date'] = pd.to_datetime(df['date'])
df['year_month'] = df['date'].dt.to_period('M')

In [22]:
df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,value,date,year_month
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29,2011-01
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29,2011-01
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29,2011-01
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29,2011-01
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29,2011-01

In [28]:
df['id'].nunique()

30490

### Fazendo série base (Receita mensal)

In [12]:
def make_total_income_series(df):
    df_total_income = df[['value', 'year_month']]
    df_total_income = df_total_income.groupby(['year_month'])['value'].sum().reset_index()
    df_total_income['unique_id'] = 'RTM'
    df_total_income.rename(columns={'value': 'y', 'year_month': 'ds'}, inplace=True)
    return df_total_income

In [13]:
df_total = make_total_income_series(df)
df_total.head(13)

         ds       y unique_id
0   2011-01   88163       RTM
1   2011-02  726375       RTM
2   2011-03  763567       RTM
3   2011-04  737713       RTM
4   2011-05  719562       RTM
5   2011-06  753380       RTM
6   2011-07  819820       RTM
7   2011-08  825694       RTM
8   2011-09  813683       RTM
9   2011-10  898243       RTM
10  2011-11  823087       RTM
11  2011-12  887298       RTM
12  2012-01  893375       RTM

In [ ]:
# # gerando a série

# def make_total_income_series(df):
#     df_total_income = df[['value', 'year_month']]
#     df_total_income = df_total_income.groupby(['year_month'])['value'].sum().reset_index()

#     output_dir = '../data'

#     if not os.path.exists(output_dir):
#         os.makedirs(output_dir)
        
#     file_name = 'total_income_series.parquet'
#     file_path = os.path.join(output_dir, file_name)

#     table = pa.Table.from_pandas(df_total_income)
#     pq.write_table(table, file_path)

In [ ]:
# make_total_income_series(df)

### Fazendo série dos estados

In [14]:
def make_state_income_series(df):
    df_state_income = df[['state_id', 'value', 'year_month']]
    df_state_income = df_state_income.groupby(['state_id', 'year_month'])['value'].sum().reset_index()
    df_state_income.rename(columns={'value': 'y', 'year_month': 'ds', 'state_id': 'unique_id'}, inplace=True)
    return df_state_income

In [15]:
df_estate = make_state_income_series(df)
df_estate.head(13)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_8016\3814129677.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_state_income = df_state_income.groupby(['state_id', 'year_month'])['value'].sum().reset_index()

   unique_id       ds       y
0         CA  2011-01   38108
1         CA  2011-02  318101
2         CA  2011-03  339678
3         CA  2011-04  331004
4         CA  2011-05  321566
5         CA  2011-06  332948
6         CA  2011-07  362183
7         CA  2011-08  361436
8         CA  2011-09  361294
9         CA  2011-10  406333
10        CA  2011-11  371336
11        CA  2011-12  399815
12        CA  2012-01  403379

In [ ]:
# # gerando a série

# def make_state_income_series(df):
#     df_state_income = df[['state_id', 'value', 'year_month']]
#     df_state_income = df_state_income.groupby(['state_id', 'year_month'])['value'].sum().reset_index()

#     output_dir = '../data'

#     if not os.path.exists(output_dir):
#         os.makedirs(output_dir)
        
#     file_name = 'state_income_series.parquet'
#     file_path = os.path.join(output_dir, file_name)

#     table = pa.Table.from_pandas(df_state_income)
#     pq.write_table(table, file_path)

In [ ]:
# make_state_income_series(df)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7728\1204820957.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_state_income = df_state_income.groupby(['state_id', 'year_month'])['value'].sum().reset_index()

### Fazendo série das lojas

In [16]:
def make_store_income_series(df):
    df_store_income = df[['store_id', 'value', 'year_month']]
    df_store_income = df_store_income.groupby(['store_id', 'year_month'])['value'].sum().reset_index()
    df_store_income.rename(columns={'value': 'y', 'year_month': 'ds', 'store_id': 'unique_id'}, inplace=True)
    return df_store_income

In [17]:
df_store = make_store_income_series(df)
df_store.head(13)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_8016\3249215959.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_store_income = df_store_income.groupby(['store_id', 'year_month'])['value'].sum().reset_index()

   unique_id       ds       y
0       CA_1  2011-01   11308
1       CA_1  2011-02   89434
2       CA_1  2011-03   93468
3       CA_1  2011-04   91553
4       CA_1  2011-05   87988
5       CA_1  2011-06   90376
6       CA_1  2011-07   96761
7       CA_1  2011-08   95113
8       CA_1  2011-09   92339
9       CA_1  2011-10  105153
10      CA_1  2011-11   99155
11      CA_1  2011-12  108145
12      CA_1  2012-01  106579

In [ ]:
# #gerando a série

# def make_store_income_series(df):
#     df_store_income = df[['store_id', 'value', 'year_month']]
#     df_store_income = df_store_income.groupby(['store_id', 'year_month'])['value'].sum().reset_index()

#     output_dir = '../data'

#     if not os.path.exists(output_dir):
#         os.makedirs(output_dir)
        
#     file_name = 'store_income_series.parquet'
#     file_path = os.path.join(output_dir, file_name)

#     table = pa.Table.from_pandas(df_store_income)
#     pq.write_table(table, file_path)

In [ ]:
# make_store_income_series(df)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7728\3766606826.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_store_income = df_store_income.groupby(['store_id', 'year_month'])['value'].sum().reset_index()

### Fazendo série das categorias

In [18]:
def make_category_income_series(df):
    df_category_income = df[['cat_id', 'value', 'year_month']]
    df_category_income = df_category_income.groupby(['cat_id', 'year_month'])['value'].sum().reset_index()
    df_category_income.rename(columns={'value': 'y', 'year_month': 'ds', 'cat_id': 'unique_id'}, inplace=True)
    return df_category_income

In [19]:
df_category = make_category_income_series(df)
df_category.head(13)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_8016\3381734233.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_category_income = df_category_income.groupby(['cat_id', 'year_month'])['value'].sum().reset_index()

   unique_id       ds       y
0      FOODS  2011-01   63110
1      FOODS  2011-02  520250
2      FOODS  2011-03  534914
3      FOODS  2011-04  509568
4      FOODS  2011-05  491753
5      FOODS  2011-06  525861
6      FOODS  2011-07  574495
7      FOODS  2011-08  580152
8      FOODS  2011-09  574927
9      FOODS  2011-10  642127
10     FOODS  2011-11  591297
11     FOODS  2011-12  650410
12     FOODS  2012-01  653360

In [ ]:
# # gerando a série

# def make_category_income_series(df):
#     df_category_income = df[['cat_id', 'value', 'year_month']]
#     df_category_income = df_category_income.groupby(['cat_id', 'year_month'])['value'].sum().reset_index()

#     output_dir = '../data'

#     if not os.path.exists(output_dir):
#         os.makedirs(output_dir)
        
#     file_name = 'category_income_series.parquet'
#     file_path = os.path.join(output_dir, file_name)

#     table = pa.Table.from_pandas(df_category_income)
#     pq.write_table(table, file_path)

In [ ]:
# make_category_income_series(df)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7728\2909717620.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_category_income = df_category_income.groupby(['cat_id', 'year_month'])['value'].sum().reset_index()

### Fazendo série dos itens

In [20]:
def make_item_income_series(df):
    df_item_income = df[['id', 'value', 'year_month']]
    df_item_income = df_item_income.groupby(['id', 'year_month'])['value'].sum().reset_index()
    df_item_income.rename(columns={'value': 'y', 'year_month': 'ds', 'id': 'unique_id'}, inplace=True)
    return df_item_income

In [21]:
df_itens = make_item_income_series(df)
df_itens.head(66)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_8016\2885779517.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_item_income = df_item_income.groupby(['id', 'year_month'])['value'].sum().reset_index()

                      unique_id       ds   y
0   FOODS_1_001_CA_1_evaluation  2011-01   3
1   FOODS_1_001_CA_1_evaluation  2011-02  40
2   FOODS_1_001_CA_1_evaluation  2011-03  40
3   FOODS_1_001_CA_1_evaluation  2011-04  23
4   FOODS_1_001_CA_1_evaluation  2011-05  50
5   FOODS_1_001_CA_1_evaluation  2011-06  28
6   FOODS_1_001_CA_1_evaluation  2011-07  27
7   FOODS_1_001_CA_1_evaluation  2011-08   2
8   FOODS_1_001_CA_1_evaluation  2011-09   0
9   FOODS_1_001_CA_1_evaluation  2011-10   0
10  FOODS_1_001_CA_1_evaluation  2011-11  42
11  FOODS_1_001_CA_1_evaluation  2011-12  54
12  FOODS_1_001_CA_1_evaluation  2012-01  24
13  FOODS_1_001_CA_1_evaluation  2012-02  22
14  FOODS_1_001_CA_1_evaluation  2012-03  38
15  FOODS_1_001_CA_1_evaluation  2012-04  32
16  FOODS_1_001_CA_1_evaluation  2012-05  31
17  FOODS_1_001_CA_1_evaluation  2012-06  25
18  FOODS_1_001_CA_1_evaluation  2012-07  29
19  FOODS_1_001_CA_1_evaluation  2012-08  66
20  FOODS_1_001_CA_1_evaluation  2012-09  39
21  FOODS_1_001_CA_1_evaluation  2012-10  29
22  FOODS_1_001_CA_1_evaluation  2012-11  31
23  FOODS_1_001_CA_1_evaluation  2012-12  36
24  FOODS_1_001_CA_1_evaluation  2013-01  19
25  FOODS_1_001_CA_1_evaluation  2013-02  27
26  FOODS_1_001_CA_1_evaluation  2013-03  21
27  FOODS_1_001_CA_1_evaluation  2013-04  12
28  FOODS_1_001_CA_1_evaluation  2013-05  23
29  FOODS_1_001_CA_1_evaluation  2013-06  27
30  FOODS_1_001_CA_1_evaluation  2013-07  29
31  FOODS_1_001_CA_1_evaluation  2013-08  12
32  FOODS_1_001_CA_1_evaluation  2013-09  17
33  FOODS_1_001_CA_1_evaluation  2013-10  16
34  FOODS_1_001_CA_1_evaluation  2013-11   0
35  FOODS_1_001_CA_1_evaluation  2013-12   0
36  FOODS_1_001_CA_1_evaluation  2014-01   0
37  FOODS_1_001_CA_1_evaluation  2014-02  18
38  FOODS_1_001_CA_1_evaluation  2014-03  21
39  FOODS_1_001_CA_1_evaluation  2014-04  30
40  FOODS_1_001_CA_1_evaluation  2014-05  29
41  FOODS_1_001_CA_1_evaluation  2014-06  27
42  FOODS_1_001_CA_1_evaluation  2014-07  15
43  FOODS_1_001_CA_1_evaluation  2014-08  28
44  FOODS_1_001_CA_1_evaluation  2014-09  21
45  FOODS_1_001_CA_1_evaluation  2014-10  27
46  FOODS_1_001_CA_1_evaluation  2014-11  15
47  FOODS_1_001_CA_1_evaluation  2014-12  35
48  FOODS_1_001_CA_1_evaluation  2015-01  22
49  FOODS_1_001_CA_1_evaluation  2015-02  17
50  FOODS_1_001_CA_1_evaluation  2015-03  19
51  FOODS_1_001_CA_1_evaluation  2015-04  20
52  FOODS_1_001_CA_1_evaluation  2015-05  17
53  FOODS_1_001_CA_1_evaluation  2015-06  19
54  FOODS_1_001_CA_1_evaluation  2015-07  17
55  FOODS_1_001_CA_1_evaluation  2015-08  17
56  FOODS_1_001_CA_1_evaluation  2015-09  15
57  FOODS_1_001_CA_1_evaluation  2015-10  18
58  FOODS_1_001_CA_1_evaluation  2015-11  24
59  FOODS_1_001_CA_1_evaluation  2015-12  26
60  FOODS_1_001_CA_1_evaluation  2016-01  15
61  FOODS_1_001_CA_1_evaluation  2016-02  21
62  FOODS_1_001_CA_1_evaluation  2016-03  27
63  FOODS_1_001_CA_1_evaluation  2016-04  32
64  FOODS_1_001_CA_1_evaluation  2016-05  20
65  FOODS_1_001_CA_2_evaluation  2011-01   2

### Concatenando o dataset

In [23]:
columns_order = ['unique_id', 'ds', 'y']

In [ ]:
df_total_income = make_total_income_series(df)
df_state_income = make_state_income_series(df)
df_store_income = make_store_income_series(df)
df_category_income = make_category_income_series(df)
df_item_income = make_item_income_series(df)

In [25]:
df_total_income = df_total_income[columns_order]
df_state_income = df_state_income[columns_order]
df_store_income = df_store_income[columns_order]
df_category_income = df_category_income[columns_order]
df_item_income = df_item_income[columns_order]

combined_df = pd.concat([df_total_income, df_state_income, df_store_income, df_category_income, df_item_income],
                        ignore_index=True)

In [27]:
combined_df['unique_id'].nunique()

30507

In [30]:
combined_df.shape

(1982955, 3)

In [29]:
output_dir = '../data'

if not os.path.exists(output_dir):
    os.makedirs(output_dir)
    
file_name = 'all_M5_series.parquet'
file_path = os.path.join(output_dir, file_name)

table = pa.Table.from_pandas(combined_df)
pq.write_table(table, file_path)